/*
*****************************************Copyright (c)**********************************************
**
**
**                                  深圳摩罗志远科技有限公司
**                             Shenzhen Maono Technology Co.,Ltd
**
**                                        www.maono.cn
**
**
**	文件名	: Crc.c
**
**	程序员	: 
**
**	日　期  : 2023年1月12日
**
**	文件描述: CRC计算。菁音的芯片没有CRC硬件外设，这里用的是软件“模拟”的CRC。
**
****************************************************************************************************
*/
#include "Crc.h"



/* 函数声明 */
void   CRC32Init(void);
void   CRC32Reset(void);
void   CRC32Add(uint32 data);
uint32 CRC32Get(void);
uint32 CRC32Calculate(uint32 *data, uint32 length);
uint32 CRC32CalculateContinue(uint32 *data, uint32 length);


/* 变量定义和声明 */
CRC32_HANDLE Crc32 = 
{
	.Init  = CRC32Init,
	.Reset = CRC32Reset,
    .Add   = CRC32Add,
    .Get   = CRC32Get,
	.Calc  = CRC32Calculate,
	.CalcContinue = CRC32CalculateContinue,
};

uint32 CRC_DATA = 0;


/*
****************************************************************************************************
**
**                                     CRC32Init()
**
**
**	功能描述: GD CRC32硬件外初始化
**
**	参  数  : 
**
**	返回值  : 
**
****************************************************************************************************
*/
void CRC32Init(void)
{
	CRC_DATA = 0;
}


/*
****************************************************************************************************
**
**                                     CRC32Reset()
**
**
**	功能描述: CRC32 Reset
**
**	参  数  : 
**
**	返回值  : 
**
****************************************************************************************************
*/
void CRC32Reset(void)
{
	CRC_DATA = 0;
}


/*
****************************************************************************************************
**
**                                     CRC32Add()
**
**
**	功能描述: CRC32 GD硬件外设方法实现
**
**	参  数  : 
**
**	返回值  : 
**
****************************************************************************************************
*/
void CRC32Add(uint32 data)
{
    CRC_DATA += data;
}


/*
****************************************************************************************************
**
**                                     CRC32Get()
**
**
**	功能描述: CRC32 GD硬件外设方法实现
**
**	参  数  : 
**
**	返回值  : 
**
****************************************************************************************************
*/
uint32 CRC32Get(void)
{
    return (CRC_DATA);
}


/*
****************************************************************************************************
**
**                                     CRC32Calculate()
**
**
**	功能描述: CRC32 GD硬件外设方法实现
**
**	参  数  : 
**
**	返回值  : 
**
****************************************************************************************************
*/
uint32 CRC32Calculate(uint32 *data, uint32 length)
{
	CRC32Reset();
	
	while (length--)
	{
		CRC_DATA += *(data++);
	}
	
	return (CRC_DATA);
}


/*
****************************************************************************************************
**
**                                     CRC32CalculateContinue()
**
**
**	功能描述: CRC32 GD硬件外设方法实现。这是累计计算，需要配合CRC32Reset进行初始化。
**
**	参  数  : 
**
**	返回值  : 
**
****************************************************************************************************
*/
uint32 CRC32CalculateContinue(uint32 *data, uint32 length)
{
	while (length--)
	{
		CRC_DATA += (*data++);
	}
	
	return (CRC_DATA);
}




