/*
*****************************************Copyright (c)**********************************************
**
**
**                                  深圳摩罗志远科技有限公司
**                             Shenzhen Maono Technology Co.,Ltd
**
**                                        www.maono.cn
**
**
**	文件名	: ParamTable.Config.c
**
**	程序员	: 
**
**	日　期  : 2022年7月22日
**
**	文件描述: 配置参数表
**
****************************************************************************************************
*/
#include "ParamTable.h"



/*	参数地址减去0x1000，就是本表的索引地址。
	给ConfigDataTable赋值前，ConfigDataTableDef的值就是出厂缺省值。
*/
uint16 ConfigTable[CONFIG_TBL_SIZE];

const uint16 ConfigTableDef[CONFIG_TBL_SIZE] =
{
/* Python 自动生成的起始行 */
	0x02BC,     // Heartbeat      ~~~~~~~~ 心跳 ~~~~~~~~
	0x0000,     // Addr           ~~~~~~~~ 设备地址 ~~~~~~~~
	0x0001,     // Number(N)      ~~~~~~~~ 系统预设总数 ~~~~~~~~
	0x0001,     // StartupNo      ~~~~~~~~ 系统启动加载的预设 ~~~~~~~~
	0x0001,     // SaveNo         ~~~~~~~~ 保存（存储器）预设 ~~~~~~~~
	0x0001,     // LoadNo         ~~~~~~~~ 加载（存储器）预设 ~~~~~~~~
	0x0000,     // DeleNo         ~~~~~~~~ 删除（存储器）预设 ~~~~~~~~
	0x0000,     // ComErrAck      ~~~~~~~~ 通讯错误 ~~~~~~~~
	0x0000,     // DFU            ~~~~~~~~ 进入升级模式 ~~~~~~~~
	NEW_REINIT_FLAG,     // ReInit  ~~~~~~~~ 系统重新初始化 ~~~~~~~~
	0x0000,     // Set            ~~~~~~~~ 恢复出厂设置 ~~~~~~~~
	0x0000,     // SyncFlag       ~~~~~~~~ 软件同步数据标志 ~~~~~~~~
	0x0000,     // SysErr1        ~~~~~~~~ 系统错误状态记录 ~~~~~~~~
	0x0000,     // SysErr2        
/* Python 自动生成的结束行 */
};


/*
****************************************************************************************************
**
**                                     _GetReInitFlag()
**
**
**	功能描述: 判断是否执行恢复出厂设置。
**
**	参  数  : 
**
**	返回值  : 
**
****************************************************************************************************
*/

uint32 _GetReInitFlag(uint32 flag)
{
	CONFIG_PARAM *Curr = (CONFIG_PARAM*)ConfigTableDef;
	
	
	/* flag            是存储区中的值，意味着是旧固件的值，未升级前。
	   ConfigTableDef  是新固件的值
	   两者进行比较
	*/
	if (flag != Curr->SysReInit)
	{
		return 1;
	}
	else
	{
		return 0;
	}
}


/*
****************************************************************************************************
**
**                                        ConfigSetDefault()
**
**
**	功能描述: 对各配置赋初始值。
**
**	参  数  : 
**
**	返回值  : 
**
****************************************************************************************************
*/
void ConfigSetDefault(void)
{	
	for (uint32 i=0; i<CONFIG_TBL_SIZE; i++)
	{
		ConfigTable[i] = ConfigTableDef[i];
	}
}




