/*
*****************************************Copyright (c)**********************************************
**
**
**                                  深圳摩罗志远科技有限公司
**                             Shenzhen Maono Technology Co.,Ltd
**
**                                        www.maono.cn
**
**
**	文件名	: Ui.c
**
**	程序员	:
**
**	日　期  : 2023年1月12日
**
**	文件描述: Ui处理
**
****************************************************************************************************
*/
#include "OsTick.h"
#include "Gpio.h"
#include "Ui.h"
#include "ParamTable.h"



/* 宏定义 */


/* 函数声明 */
void UiInit(void);


/* 变量定义和声明 */
UI_HANDLE  Ui =
{
	.Led  = &UiLed,

	.Init = UiInit,
};


/*
****************************************************************************************************
**
**                                        UiInit()
**
**	功能描述:
**
**	参  数  :
**
**	返回值  :
**
****************************************************************************************************
*/
void UiInit(void)
{
	Ui.Led->Init();
}




