/*
*****************************************Copyright (c)**********************************************
**
**
**                                  深圳摩罗志远科技有限公司
**                             Shenzhen Maono Technology Co.,Ltd
**
**                                        www.maono.cn
**
**
**	文件名	: Com.c
**
**	程序员	: 
**
**	日　期  : 2021年12月23日
**
**	文件描述: Communication通讯处理类。应用于PC电脑软件控制。一般是USB、串口等。
**
****************************************************************************************************
*/
#include "UserRetype.h"
#include "Hid.h"
#include "Com.h"



/* 函数声明 */
void ComInit(void);
void ComTask(void);

extern void ComTxParamRandWrite(uint16 *data, uint32 len);
extern void HidRxProcess(void);


/* 变量定义和声明 */
COM_HANDLE Com = 
{
	.Init = ComInit,
	.Task = ComTask,

	.Tx = 
	{
		.ParamRandWrite = ComTxParamRandWrite,
	}
};


/*
****************************************************************************************************
**
**                                         ComInit()
**
**
**	功能描述: 通讯初始化
**
**	参  数  : 
**
**	返回值  : 
**
****************************************************************************************************
*/
void ComInit(void)
{
}


/*
****************************************************************************************************
**
**                                         ComTask()
**
**
**	功能描述: 通讯处理任务
**
**	参  数  : 
**
**	返回值  : 
**
****************************************************************************************************
*/
void ComTask(void)
{
	HidRxProcess();
}




