/*
*****************************************Copyright (c)**********************************************
**
**
**                                  深圳摩罗志远科技有限公司
**                             Shenzhen Maono Technology Co.,Ltd
**
**                                        www.maono.cn
**
**
**	文件名	: Dsp.c
**
**	程序员	: 
**
**	日　期  : 2021年12月23日
**
**	文件描述: DSP类。与DSP相关的功能、数据都由此类来管理。
**
****************************************************************************************************
*/
#include "OsTick.h"
#include "Gpio.h"
#include "Dsp.h"
#include "Dsp2.h"
#include "ParamTable.h"



/* 函数声明 */
void DspInit(void);
void DspTask(void);


/* 变量定义和声明 */
extern DSP_COMM    DspComm;
extern DSP_PROGRAM DspProgram;

DSP_CLASS Dsp =
{
	.Init      = DspInit,
	.Task      = DspTask,
	
	.Comm    = &DspComm,
	.Program = &DspProgram,
};


/*
****************************************************************************************************
**
**                                           DspInit()
**
**
**	功能描述: 系统DSP初始化。复位和下载代码。
**
**	参  数  : 
**
**	返回值  : 
**
****************************************************************************************************
*/
void DspInit(void)
{
	DspComm.Init();
	
	Dsp.Program->Bootloader();
}


/*
****************************************************************************************************
**
**                                           DspTask()
**
**
**	功能描述: Dsp任务，一般在主循环中调用。
**
**	参  数  : 
**
**	返回值  : 
**
****************************************************************************************************
*/
uint32 DspTest = 0;		// 临时调试

void DspTask(void)
{
	if (DspTest)
	{
		DspTest = 0;
		Dsp.Program->Unmute();
	}
}




