/**
 ******************************************************************************
 *
 *         Copyright (C) 2021 JinAudio Technology (shanghai) Co.,LTD.
 *
 ******************************************************************************
 * @file    a0_hal_gpio.c
 * @brief   GPIO HAL module.
 * @version V1.0.3
 * @date    2022/04/07
 * @author  huangzheng
 ******************************************************************************
 */

/**
 * 版本日志：
 * V1.0.3, 2022/04/07
 *      1. 函数命名按照大驼峰方式命名，头文件增加原函数名的define，为了兼容原代码，后续希望渐渐过渡到统一风格书写规范
 *      2. 整理头文件中依赖关系，使用jat_typedef.h作为数据类型的头文件，并把include放到extern "C" 之外
 *      3. 将一些配置选项移到a0_hal_conf.h，统一进行配置
 * V1.0.2, 2021/10/11
 *      1. 将ADC模块独立出去
 *      2. 外部中断部分宏定义名称更新
 *      3. 头文件中的注释部分调整，适应Doxygen
 * V1.0.1, 2021/05/13,
 *      1. 头文件中部分宏定义注释补全
 *      2. 添加一些常用GPIO的配置接口函数
 * V1.0.0, 2021/04/14,
 *      1. 初版，GPIO控制器HAL层函数接口，头文件中包含各GPIO寄存器的接口宏定义，同时包括外部中断和21路ADC寄存器的接口宏定义
 */
/* Includes -----------------------------------------------------------------*/
#include "a0_hal_conf.h"
/**
 * @addtogroup A0_HAL_Driver
 * @{
 */
/**
 * @addtogroup GPIO
 * @{
 */

#ifdef HAL_GPIO_MODULE_ENABLED
#include "a0_hal_gpio.h"
#include "a0_hal_def.h"
/* Private typedef ----------------------------------------------------------*/
/* Private define -----------------------------------------------------------*/
/* Private macro ------------------------------------------------------------*/
/* Private variables --------------------------------------------------------*/
/* Private function prototypes ----------------------------------------------*/
/* Exported functions -------------------------------------------------------*/
/**
 * @defgroup GPIO_Exported_Functions GPIO Exported Functions
 * @{
 */
/* GPIO部分 */
/*
    目前使用a0_hal_gpio.h中的宏，基本够用，不需要额外的hal层代码，除非用户的一些特殊应用，可以自行添加
    如：需要对多个IO的复用，上下拉，驱动能力进行配置时，不使用 HAL_GPIO_AF_SET, HAL_GPIO_PUPD_SET, HAL_GPIO_DRV_SET
    进行逐个IO的配置，直接操作
    GPIOx->AFR[0]~GPIOx->AFR[3] 进行复用配置
    GPIOx->PUPDR[0]~GPIOx->PUPDR[1] 进行上下拉配置
    GPIOx->DRVR[0]~GPIOx->DRVR[1] 进行驱动能力配置
    其中x是0或1，即GPIO0或GPIO1
*/
/* 外部中断部分 */
/*
    目前使用a0_hal_gpio.h中的宏，基本够用，不需要额外的hal层代码，除非用户的一些特殊应用，可自行添加
    如：需要读取外部中断源选择寄存器值，进行处理的话，直接通过 EXTIx->SEL[0] 和 EXTIx->SEL[1] 读取对应值，进行操作
*/
/**
 * @}
 */

#endif
/**
 * @}
 */
/**
 * @}
 */
