/*
*****************************************Copyright (c)**********************************************
**
**
**                                  深圳摩罗志远科技有限公司
**                             Shenzhen Maono Technology Co.,Ltd
**
**                                        www.maono.cn
**
**
**	文件名	: Dfu.Encrypt.c
**
**	程序员	: 
**
**	日　期  : 2023年1月12日
**
**	文件描述: 对升级文件进行加解密。上位机做加密，下位机做解密。
**
****************************************************************************************************
*/
#include "UserRetype.h"



uint32 GammaKey = 0x1C9CBB63;	// 密钥

/*
****************************************************************************************************
**
**                                       GammaEncrypt()
**
**
**	功能描述：伽马加密算法 - 加密
**
**	参  数  ：data	要加密的数据，4字节的整数倍。如果不满足的，可以用00来补齐
**            len	数据长度（单位字节）
**            key	密钥
**
**	返回值  ：data	返回加密后的数据
**
****************************************************************************************************
*/
#if 0
void GammaEncrypt(uint8 *data, uint32 len)
{	
	uint32 i, j;
	uint32 tmp, lsb, msb;

	
	for (i=0; i<len/4; i++)
	{
		for (j=0; j<4; j++, data++)
		{		
			tmp = *data;			
			tmp = tmp ^ ((GammaKey >> 8*j) & 0xFF);
			
			msb = (tmp & 0x0F) << 4;
			lsb = (tmp & 0xF0) >> 4;
			
			*data = (uint8_t)((msb | lsb) + 0xA3);
		}
	}
}
#endif


/*
****************************************************************************************************
**
**                                       GammaDecrypt()
**
**
**	功能描述：伽马加密算法 - 解密
**
**	参  数  ：data	要加密的数据，4字节的整数倍。如果不满足的，可以用00来补齐
**            len	数据长度（单位字节）
**            key	密钥
**
**	返回值  ：data	返回解密后的数据
**
****************************************************************************************************
*/
void GammaDecrypt(uint8 *data, uint32 len)
{
    uint32 i, j;
	uint32 tmp, lsb, msb;

	
	for (i=0; i<len/4; i++)
	{
		for (j=0; j<4; j++, data++)
		{	
			tmp = *data - 0xA3;
			
			msb = (tmp & 0x0F) << 4;
			lsb = (tmp & 0xF0) >> 4;
			tmp = msb | lsb;
			
			*data = (uint8)(tmp ^ ((GammaKey >> 8*j) & 0xFF));	
		}
	}
}




