/*
*****************************************Copyright (c)**********************************************
**
**
**                                  深圳摩罗志远科技有限公司
**                             Shenzhen Maono Technology Co.,Ltd
**
**                                        www.maono.cn
**
**
**	文件名	: Mem.SaveLoad.h
**
**	程序员	: 
**
**	日　期  : 2021年12月23日
**
**	文件描述: 参数保存与加载。
**
****************************************************************************************************
*/
#ifndef _MEM_SAVE_LOAD_H
#define _MEM_SAVE_LOAD_H
#include "UserRetype.h"



#endif




